Repository: 1sLand99/Gepetto
Catalog: gepetto/locales/*/LC_MESSAGES/gepetto.po
Languages: ca_es, es_es, fr_fr, it_it, ru, tr

source: Attempting to load the first available model...
ca_es: S'està intentant carregar el primer model disponible...
es_es: Intentando cargar el primer modelo disponible...
fr_fr: Tentative de chargement du premier modèle disponible...
it_it: Tentativo di caricare il primo modello disponibile...
ru: Попытка загрузить первую доступную модель...
tr: Kullanılabilir ilk modeli yüklemeye çalışılıyor...

source: No model available. Please edit the configuration file and try again.
ca_es: No hi ha cap model disponible. Si us plau, editeu el fitxer de configuració i torneu-ho a intentar.
es_es: No hay ningún modelo disponible. Por favor, edite el archivo de configuración e inténtelo de nuevo.
fr_fr: Aucun modèle disponible. Veuillez modifier le fichier de configuration et réessayer.
it_it: Nessun modello disponibile. Modifica il file di configurazione e riprova.
ru: Модель недоступна. Пожалуйста, измените файл конфигурации и попробуйте снова.
tr: Kullanılabilir model yok. Lütfen yapılandırma dosyasını düzenleyin ve tekrar deneyin.

source: Warning: Gepetto's configuration doesn't contain option {option} in section {section}!
ca_es: Advertència: La configuració de Gepetto no conté l'opció {option} a la secció {section}!
es_es: Advertencia: La configuración de Gepetto no contiene la opción {option} en la sección {section}!
fr_fr: Attention: la configuration de Gepetto ne contient pas l'option {option} dans la section {section} !
it_it: Avviso: La configurazione di Gepetto non contiene l'opzione {option} nella sezione {section}!
ru: Предупреждение: В конфигурации Gepetto отсутствует опция {option} в разделе {section}!
tr: Uyarı: Gepetto'nun yapılandırmasında {section} bölümünde {option} seçeneği yok!

source: LLM chat
ca_es: Conversación de LLM
es_es: Conversación de LLM
fr_fr: Conversation avec le LLM
it_it: Conversazione LLM
ru: Чат LLM
tr: LLM sohbet

source: → Model requested tool: {tool_name} ({tool_args}...)
ca_es: → El model ha demanat l'eina: {tool_name} ({tool_args}...)
es_es: → El modelo solicitó la herramienta: {tool_name} ({tool_args}...)
fr_fr: → Le modèle a demandé l'outil : {tool_name} ({tool_args}...)
it_it: → Il modello ha richiesto lo strumento: {tool_name} ({tool_args}...)
ru: → Модель запросила инструмент: {tool_name} ({tool_args}...)
tr: → Modelin istediği araç: {tool_name} ({tool_args}...)

source: Using tool: {tool_name}
ca_es: S'està utilitzant l'eina: {tool_name}
es_es: Usando la herramienta: {tool_name}
fr_fr: Utilisation de l'outil : {tool_name}
it_it: Uso dello strumento: {tool_name}
ru: Используется инструмент: {tool_name}
tr: Kullanılan araç: {tool_name}

source: ✔ Completed turn
ca_es: ✔ Torn completat
es_es: ✔ Turno completado
fr_fr: ✔ Tour terminé
it_it: ✔ Turno completato
ru: ✔ Ход завершён
tr: ✔ Tur tamamlandı

source: Model request failed.
ca_es: La sol·licitud al model ha fallat.
es_es: La solicitud al modelo falló.
fr_fr: La requête du modèle a échoué.
it_it: La richiesta al modello è fallita.
ru: Запрос к модели не выполнен.
tr: Model isteği başarısız oldu.

source: Streaming unavailable for this model; retrying without streaming.
ca_es: La transmissió no està disponible per a aquest model; es torna a intentar sense transmissió.
es_es: La transmisión no está disponible para este modelo; reintentando sin transmisión.
fr_fr: Diffusion indisponible pour ce modèle ; nouvel essai sans diffusion.
it_it: Lo streaming non è disponibile per questo modello; nuovo tentativo senza streaming.
ru: Для этой модели потоковая передача недоступна; повторная попытка без потока.
tr: Bu model için yayın kullanılamıyor; yayın olmadan yeniden deneniyor.

source: Retrying without streaming
ca_es: Tornant a intentar sense transmissió
es_es: Reintentando sin transmisión
fr_fr: Nouvel essai sans diffusion
it_it: Nuovo tentativo senza streaming
ru: Повторная попытка без потоковой передачи
tr: Yayın olmadan yeniden deneniyor

source: No focused view available; cannot determine current function.
ca_es: No hi ha cap vista enfocada disponible; no es pot determinar la funció actual.
es_es: No hay una vista enfocada disponible; no se puede determinar la función actual.
fr_fr: Aucune vue focalisée disponible ; impossible de déterminer la fonction actuelle.
it_it: Nessuna vista con focus disponibile; impossibile determinare la funzione corrente.
ru: Нет активного представления; не удаётся определить текущую функцию.
tr: Odaklanılmış bir görünüm yok; geçerli fonksiyon belirlenemiyor.

source: [ERROR] comment callback JSON failure: {error}
ca_es: [ERROR] error JSON a la devolució de comentaris: {error}
es_es: [ERROR] fallo JSON en la devolución de comentario: {error}
fr_fr: [ERREUR] échec JSON du rappel de commentaire : {error}
it_it: [ERRORE] errore JSON del callback dei commenti: {error}
ru: [ОШИБКА] ошибка JSON обратного вызова комментариев: {error}
tr: [HATA] yorum geri çağrısında JSON hatası: {error}

source: [ERROR] comment application failed: {error}
ca_es: [ERROR] no s'han pogut aplicar els comentaris: {error}
es_es: [ERROR] error al aplicar comentarios: {error}
fr_fr: [ERREUR] l'application des commentaires a échoué : {error}
it_it: [ERRORE] applicazione dei commenti non riuscita: {error}
ru: [ОШИБКА] не удалось применить комментарии: {error}
tr: [HATA] yorum uygulanamadı: {error}

source: Applied {count} comments.
ca_es: S'han aplicat {count} comentaris.
es_es: Se aplicaron {count} comentarios.
fr_fr: {count} commentaires appliqués.
it_it: Applicati {count} commenti.
ru: Применено {count} комментариев.
tr: {count} yorum uygulandı.

source: No comments were applied.
ca_es: No s'ha aplicat cap comentari.
es_es: No se aplicó ningún comentario.
fr_fr: Aucun commentaire n'a été appliqué.
it_it: Nessun commento è stato applicato.
ru: Комментарии не были применены.
tr: Herhangi bir yorum uygulanmadı.

source: [ERROR] comment_callback: {error}
ca_es: [ERROR] callback de comentaris: {error}
es_es: [ERROR] callback de comentarios: {error}
fr_fr: [ERREUR] comment_callback : {error}
it_it: [ERRORE] comment_callback: {error}
ru: [ОШИБКА] comment_callback: {error}
tr: [HATA] comment_callback: {error}

source: Comment generated by Gepetto
ca_es: Comentari generat per Gepetto
es_es: Comentario generado por Gepetto
fr_fr: Commentaire généré par Gepetto
it_it: Commento generato da Geppetto
ru: Комментарий создан Gepetto
tr: Gepetto tarafından oluşturulan yorum

source: [ERROR] comment callback failed: {error}
ca_es: [ERROR] la devolució de comentaris ha fallat: {error}
es_es: [ERROR] falló la devolución de comentario: {error}
fr_fr: [ERREUR] le rappel de commentaire a échoué : {error}
it_it: [ERRORE] callback dei commenti non riuscito: {error}
ru: [ОШИБКА] обратный вызов комментариев завершился с ошибкой: {error}
tr: [HATA] yorum geri çağrısı başarısız oldu: {error}

source: [ERROR] rename callback JSON failure: {error}
ca_es: [ERROR] error JSON a la devolució de canvi de nom: {error}
es_es: [ERROR] fallo JSON en la devolución de cambio de nombre: {error}
fr_fr: [ERREUR] échec JSON du rappel de renommage : {error}
it_it: [ERRORE] errore JSON del callback di rinomina: {error}
ru: [ОШИБКА] ошибка JSON обратного вызова переименования: {error}
tr: [HATA] yeniden adlandırma geri çağrısında JSON hatası: {error}

source: Function at EA 0x{ea:X} not found.
ca_es: No s'ha trobat la funció a EA 0x{ea:X}.
es_es: No se encontró la función en EA 0x{ea:X}.
fr_fr: Fonction introuvable à l'adresse EA 0x{ea:X}.
it_it: Funzione a EA 0x{ea:X} non trovata.
ru: Функция по адресу EA 0x{ea:X} не найдена.
tr: EA 0x{ea:X} adresindeki fonksiyon bulunamadı.

source: Select names to rename
ca_es: Seleccioneu els noms a canviar
es_es: Seleccionar nombres para renombrar
fr_fr: Sélectionnez les noms à renommer
it_it: Seleziona i nomi da rinominare
ru: Выберите имена для переименования
tr: Yeniden adlandırılacak adları seç

source: Old Name
ca_es: Nom antic
es_es: Nombre anterior
fr_fr: Ancien nom
it_it: Vecchio nome
ru: Старое имя
tr: Eski ad

source: New Name
ca_es: Nom nou
es_es: Nombre nuevo
fr_fr: Nouveau nom
it_it: Nuovo nome
ru: Новое имя
tr: Yeni ad

source: [ERROR] rename callback failed: {error}
ca_es: [ERROR] la devolució de canvi de nom ha fallat: {error}
es_es: [ERROR] falló la devolución de cambio de nombre: {error}
fr_fr: [ERREUR] le rappel de renommage a échoué : {error}
it_it: [ERRORE] callback di rinomina non riuscito: {error}
ru: [ОШИБКА] обратный вызов переименования завершился с ошибкой: {error}
tr: [HATA] yeniden adlandırma geri çağrısı başarısız oldu: {error}

source: Rename cancelled by user.
ca_es: Canvi de nom cancel·lat per l'usuari.
es_es: Cambio de nombre cancelado por el usuario.
fr_fr: Renommage annulé par l'utilisateur.
it_it: Rinomina annullata dall'utente.
ru: Переименование отменено пользователем.
tr: Yeniden adlandırma kullanıcı tarafından iptal edildi.

source: Done! {count} name(s) renamed.
ca_es: Fet! S'han reanomenat {count} nom(s).
es_es: ¡Hecho! Se ha(n) renombrado {count} nombre(s).
fr_fr: Terminé ! {count} nom(s) renommé(s).
it_it: Fatto! Rinominati {count} nome(i).
ru: Готово! Переименовано {count} имён.
tr: Bitti! {count} ad yeniden adlandırıldı.

source: Couldn't change model to {model}: {error}
ca_es: No s'ha pogut canviar el model a {model}: {error}
es_es: No se pudo cambiar el modelo a {model}: {error}
fr_fr: Impossible de changer le modèle pour {model} : {error}
it_it: Impossibile cambiare il modello in {model}: {error}
ru: Не удалось переключить модель на {model}: {error}
tr: Model {model} olarak değiştirilemedi: {error}

source: {model} generated code saved to {file_name}
ca_es: Codi generat per {model} desat a {file_name}
es_es: Código generado por {model} guardado en {file_name}
fr_fr: Code généré par {model} enregistré dans {file_name}
it_it: Codice generato da {model} salvato in {file_name}
ru: Сгенерированный {model} код сохранён в {file_name}
tr: {model} tarafından oluşturulan kod {file_name} dosyasına kaydedildi

source: System
ca_es: Sistema
es_es: Sistema
fr_fr: Système
it_it: Sistema
ru: Система
tr: Sistem

source: User
ca_es: Usuari
es_es: Usuario
fr_fr: Utilisateur
it_it: Utente
ru: Пользователь
tr: Kullanıcı

source: Tool
ca_es: Eina
es_es: Herramienta
fr_fr: Outil
it_it: Strumento
ru: Инструмент
tr: Araç

source: Model
ca_es: Model actual
es_es: Modelo
fr_fr: Modèle
it_it: Modello
ru: Модель
tr: Model (seçili)

source: Assistant
ca_es: Assistent
es_es: Asistente
fr_fr: Assistant(e)
it_it: Assistente
ru: Ассистент
tr: Asistan

source: Log filters:
ca_es: Filtres del registre:
es_es: Filtros del registro:
fr_fr: Filtres du journal :
it_it: Filtri del log:
ru: Фильтры журнала:
tr: Günlük filtreleri:

source: Clear
ca_es: Neteja
es_es: Limpiar
fr_fr: Effacer
it_it: Cancella
ru: Очистить
tr: Temizle

source: Type a prompt and press Enter…
ca_es: Escriviu una petició i premeu Retorn…
es_es: Escriba una solicitud y presione Intro…
fr_fr: Saisissez une requête puis appuyez sur Entrée…
it_it: Digita un prompt e premi Invio…
ru: Введите запрос и нажмите Enter…
tr: Bir istem yazın ve Enter'a basın…

source: Send
ca_es: Envia
es_es: Enviar
fr_fr: Envoyer
it_it: Invia
ru: Отправить
tr: Gönder

source: Stop
ca_es: Atura
es_es: Detener
fr_fr: Arrêter
it_it: Ferma
ru: Остановить
tr: Durdur

source: Model: {model} ▼
ca_es: Model seleccionat: {model} ▼
es_es: Modelo: {model} ▼
fr_fr: Modèle : {model} ▼
it_it: Modello: {model} ▼
ru: Модель: {model} ▼
tr: Model: {model} ▼ (seçili)

source: Status: {status}
ca_es: Estat: {status}
es_es: Estado: {status}
fr_fr: Statut : {status}
it_it: Stato: {status}
ru: Статус: {status}
tr: Durum: {status}

source: Idle
ca_es: Inactiu
es_es: Inactivo
fr_fr: Au repos
it_it: Inattivo
ru: Ожидание
tr: Boşta

source: Failed to send prompt: {err}
ca_es: Error en enviar la sol·licitud: {err}
es_es: Error al enviar la solicitud: {err}
fr_fr: Échec de l'envoi de la requête : {err}
it_it: Errore nell'invio della richiesta: {err}
ru: Не удалось отправить запрос: {err}
tr: İstek gönderilemedi: {err}

source: Error loading models
ca_es: Error en carregar els models
es_es: Error al cargar los modelos
fr_fr: Erreur lors du chargement des modèles
it_it: Errore nel caricamento dei modelli
ru: Ошибка загрузки моделей
tr: Modeller yüklenemedi

source: Model switched to {model}
ca_es: Model canviat a {model}
es_es: Modelo cambiado a {model}
fr_fr: Modèle changé pour {model}
it_it: Modello cambiato in {model}
ru: Модель переключена на {model}
tr: Model {model} olarak değiştirildi

source: Failed to switch model: {error}
ca_es: Error en canviar el model: {error}
es_es: Error al cambiar el modelo: {error}
fr_fr: Échec du changement de modèle : {error}
it_it: Errore nel cambio del modello: {error}
ru: Не удалось сменить модель: {error}
tr: Model değiştirilemedi: {error}

source: Error - Check Log
ca_es: Error: comproveu el registre
es_es: Error: revise el registro
fr_fr: Erreur : consultez le journal
it_it: Errore: controlla il log
ru: Ошибка — проверьте журнал
tr: Hata - Günlüğü kontrol edin

source: Cancelling…
ca_es: Cancel·lant…
es_es: Cancelando…
fr_fr: Annulation…
it_it: Annullamento…
ru: Отмена…
tr: İptal ediliyor…

source: Cancelling request
ca_es: Cancel·lant la sol·licitud
es_es: Cancelando la solicitud
fr_fr: Annulation de la requête
it_it: Annullamento della richiesta
ru: Отмена запроса
tr: İstek iptal ediliyor

source: You
ca_es: Tu
es_es: Tú
fr_fr: Vous
it_it: Tu
ru: Вы
tr: Siz

source: User: {text}
ca_es: Usuari: {text}
es_es: Usuario: {text}
fr_fr: Utilisateur : {text}
it_it: Utente: {text}
ru: Пользователь: {text}
tr: Kullanıcı: {text}

source: Assistant: {text}
ca_es: Assistent: {text}
es_es: Asistente: {text}
it_it: Assistente: {text}
ru: Ассистент: {text}
tr: Asistan: {text}

source: Could not show Gepetto Status panel.
ca_es: No s'ha pogut mostrar el panell d'estat de Gepetto.
es_es: No se pudo mostrar el panel de estado de Gepetto.
fr_fr: Impossible d'afficher le panneau d'état de Gepetto.
it_it: Impossibile mostrare il pannello di stato di Gepetto.
ru: Не удалось открыть панель состояния Gepetto.
tr: Gepetto Durum paneli gösterilemedi.

source: Failed to cancel request
ca_es: No s'ha pogut cancel·lar la sol·licitud
es_es: No se pudo cancelar la solicitud
fr_fr: Échec de l'annulation de la requête
it_it: Impossibile annullare la richiesta
ru: Не удалось отменить запрос
tr: İstek iptal edilemedi

source: Done
ca_es: Fet
es_es: Listo
fr_fr: Terminé
it_it: Fatto
ru: Готово
tr: Bitti

source: Request to {model} sent...
ca_es: Sol·licitud enviada a {model}...
es_es: Solicitud enviada a {model}...
fr_fr: Requête envoyée à {model}...
it_it: Richiesta inviata a {model}...
ru: Запрос к {model} отправлен...
tr: {model}'a istek gönderildi...

source: Waiting for model...
ca_es: Esperant el model...
es_es: Esperando al modelo...
fr_fr: En attente du modèle...
it_it: In attesa del modello...
ru: Ожидание модели...
tr: Model bekleniyor...

source: {model} query finished in {time:.2f} seconds!
ca_es: La consulta de {model} ha finalitzat en {time:.2f} segons!
es_es: ¡Consulta de {model} finalizada en {time:.2f} segundos!
fr_fr: Requête {model} terminée en {time:.2f} secondes !
it_it: Richiesta a {model} completata in {time:.2f} secondi!
ru: Запрос к {model} завершён за {time:.2f} с!
tr: {model} isteği {time:.2f} saniyede tamamlandı!

source: Explain function
ca_es: Explicar la funció
es_es: Explicar la función
fr_fr: Expliquer la fonction
it_it: Descrivi la funzione
ru: Объяснить функцию
tr: işlevi açıkla

source: Comment function
ca_es: Explicar la funció
es_es: Explicar la función
fr_fr: Expliquer la fonction
it_it: Descrivi la funzione
ru: Комментировать функцию
tr: işlevi açıkla

source: Auto-rename
ca_es: Reanomenar automàticament
es_es: Renombrado automático
fr_fr: Renommage automatique
it_it: Rinominazione automatica
ru: Автопереименование
tr: Otomatik yeniden adlandırma

source: Generate C Code
ca_es: Genera codi C
es_es: Generar código C
fr_fr: Générer du code C
it_it: Genera codice C
ru: Сгенерировать код C
tr: C kodu oluştur

source: Generate Python Code
ca_es: Genera codi Python
es_es: Generar código Python
fr_fr: Générer du code Python
it_it: Genera codice Python
ru: Сгенерировать код Python
tr: Python kodu oluştur

source: Uses {model} to enrich the decompiler's output
ca_es: Utilitza {model} per enriquir la sortida del descompilador
es_es: Utiliza {model} para enriquecer la salida del descompilador
fr_fr: Enrichit la sortie du décompilateur avec {model}
it_it: Usa {model} per arricchire il codice decompilato
ru: Использует {model} для обогащения вывода декомпилятора
tr: Derleyicinin çıktısını zenginleştirmek için {model} kullanır

source: See usage instructions on GitHub
ca_es: Veure instruccions d'ús a GitHub
es_es: Ver instrucciones de uso en GitHub
fr_fr: Aide du programme disponible sur GitHub
it_it: Consulta le istruzioni d'uso su GitHub
ru: См. инструкции по использованию на GitHub.
tr: GitHub'daki kullanım talimatlarına bakın

source: Use {model} to explain the currently selected function
ca_es: Utilitzar {model} per explicar la funció seleccionada actualment
es_es: Usar {model} para explicar la función seleccionada actualmente
fr_fr: Utiliser {model} pour expliquer la fonction sélectionnée
it_it: Usa {model} per descrivere la funzione selezionata
ru: Используйте {model} для объяснения выбранной функции
tr: Seçili olan fonksiyonu açıklamak için {model} kullanın

source: Adds comments to lines in the current function using {model}
ca_es: Afegeix comentaris a les línies de la funció actual amb {model}
es_es: Añade comentarios a las líneas de la función actual usando {model}
fr_fr: Ajoute des commentaires aux lignes de la fonction actuelle avec {model}
it_it: Aggiunge commenti alle righe della funzione corrente con {model}
ru: Добавляет комментарии к строкам текущей функции с помощью {model}
tr: {model} kullanarak geçerli fonksiyonun satırlarına açıklamalar ekler

source: Use {model} to auto-rename this function and its variables
ca_es: Utilitzar {model} per reanomenar automàticament aquesta funció i les seves variables
es_es: Usar {model} para renombrar automáticamente esta función y sus variables
fr_fr: Utiliser {model} pour renommer automatiquement cette fonction et ses variables
it_it: Usa {model} per rinominare automaticamente questa funzione e le sue variabili
ru: Используйте {model} для автоматического переименования этой функции и её переменных
tr: Bu fonksiyonu ve değişkenlerini otomatik olarak yeniden adlandırmak için {model} kullanın

source: Generate python code from the currently selected function using {model}
ca_es: Utilitzar {model} per explicar la funció seleccionada actualment
es_es: Usar {model} para explicar la función seleccionada actualmente
fr_fr: Utiliser {model} pour expliquer la fonction sélectionnée
it_it: Usa {model} per descrivere la funzione selezionata
ru: Добавляет комментарии к строкам текущей функции, используя {model}
tr: Seçili olan fonksiyonu açıklamak için {model} kullanın

source: Generate executable C code from the currently selected function using {model}
ca_es: Genera codi C executable de la funció seleccionada amb {model}
es_es: Genera código C ejecutable de la función seleccionada usando {model}
fr_fr: Génère du code C exécutable pour la fonction sélectionnée avec {model}
it_it: Genera codice C eseguibile dalla funzione selezionata usando {model}
ru: Сгенерируйте исполняемый код C из выбранной функции с помощью {model}
tr: Seçilen fonksiyondan {model} ile çalıştırılabilir C kodu üretir

source: Options
ca_es: Opcions
es_es: Opciones
fr_fr: Paramètres
it_it: Opzioni
ru: Параметры
tr: Seçenekler

source: Auto-open status panel
ca_es: Obre automàticament el panell d'estat
es_es: Abrir automáticamente el panel de estado
fr_fr: Ouvrir automatiquement le panneau d'état
it_it: Apri automaticamente il pannello di stato
ru: Автоматически открывать панель состояния
tr: Durum panelini otomatik aç

source: Select model
ca_es: Selecciona el model
es_es: Seleccionar modelo
fr_fr: Sélectionner un modèle
it_it: Seleziona modello
ru: Выберите модель
tr: Model seç

source: Automatically focus the Gepetto status panel when a request starts.
ca_es: Centra automàticament el panell d'estat de Gepetto quan comença una sol·licitud.
es_es: Enfocar automáticamente el panel de estado de Gepetto al iniciar una solicitud.
fr_fr: Activer automatiquement le panneau d'état de Gepetto au début d'une requête.
it_it: Metti automaticamente a fuoco il pannello di stato di Gepetto all'avvio di una richiesta.
ru: Автоматически переводить фокус на панель состояния Gepetto при запуске запроса.
tr: Bir istek başladığında Gepetto durum panelini otomatik olarak odakla.

source: Please edit the configuration file to insert your {api_provider} API key!
ca_es: Si us plau, editeu aquest script per inserir la vostra clau d'API de {api_provider}!
es_es: ¡Edite este script para insertar su clave de API de {api_provider}!
fr_fr: Merci d'ajouter votre clé API {api_provider} dans le fichier de configuration !
it_it: Per favore, modifica lo script insendo la tua {api_provider} API key!
ru: Пожалуйста, отредактируйте этот скрипт, чтобы добавить свой {api_provider} API ключ!
tr: {api_provider} API anahtarınızı eklemek için lütfen bu betiği düzenleyin!

source: Failed to fetch Gemini models: {error}
ca_es: No s'han pogut obtenir els models de Gemini: {error}
es_es: No se pudieron obtener los modelos de Gemini: {error}
fr_fr: Échec de la récupération des modèles Gemini : {error}
it_it: Impossibile recuperare i modelli Gemini: {error}
ru: Не удалось получить модели Gemini: {error}
tr: Gemini modelleri alınamadı: {error}

source: Failed to configure proxy for Gemini models: {error}
ca_es: No s'ha pogut configurar el servidor intermediari per als models Gemini: {error}
es_es: No se pudo configurar el proxy para los modelos Gemini: {error}
fr_fr: Échec de la configuration du proxy pour les modèles Gemini : {error}
it_it: Impossibile configurare il proxy per i modelli Gemini: {error}
ru: Не удалось настроить прокси для моделей Gemini: {error}
tr: Gemini modelleri için vekil sunucu yapılandırılamadı: {error}

source: Failed to fetch models from {base_url}: {status_code}
ca_es: No s'han pogut obtenir models des de {base_url}: {status_code}
es_es: No se pudieron obtener modelos de {base_url}: {status_code}
fr_fr: Échec de la récupération des modèles depuis {base_url} : {status_code}
it_it: Impossibile recuperare modelli da {base_url}: {status_code}
ru: Не удалось получить модели с {base_url}: {status_code}
tr: {base_url} adresinden modeller alınamadı: {status_code}

source: General exception encountered while running the query: {error}
ca_es: S'ha trobat una excepció general mentre s'executava la consulta: {error}
es_es: Se encontró una excepción general mientras se ejecutaba la consulta: {error}
fr_fr: Erreur générale rencontrée lors de l'exécution de la requête : {error}
it_it: Eccezione rilevata durante l'esecuzione della query: {error}
ru: Общее исключение, возникшее при выполнении запроса: {error}
tr: Sorgu çalıştırılırken genel istisna ile karşılaşıldı: {error}

source: Failed to fetch models from {base_url}: {error}
ca_es: No s'han pogut obtenir models des de {base_url}: {error}
es_es: No se pudieron obtener modelos de {base_url}: {error}
fr_fr: Échec de la récupération des modèles depuis {base_url} : {error}
it_it: Impossibile recuperare modelli da {base_url}: {error}
ru: Не удалось получить модели с {base_url}: {error}
tr: {base_url} adresinden modeller alınamadı: {error}
