Repository: 1sLand99/Gepetto
Catalog: gepetto/locales/*/LC_MESSAGES/gepetto.po
Languages: ca_es, es_es, fr_fr, it_it, ru, tr

source: Failed to configure proxy for LM Studio models: {error}
ca_es: No s'ha pogut configurar el servidor intermediari per als models de LM Studio: {error}
es_es: No se pudo configurar el proxy para los modelos de LM Studio: {error}
fr_fr: Échec de la configuration du proxy pour les modèles LM Studio : {error}
it_it: Impossibile configurare il proxy per i modelli LM Studio: {error}
ru: Не удалось настроить прокси для моделей LM Studio: {error}
tr: LM Studio modelleri için vekil sunucu yapılandırılamadı: {error}

source: Failed to fetch OpenAI models: {error}
ca_es: No s'han pogut obtenir els models d'OpenAI: {error}
es_es: No se pudieron obtener los modelos de OpenAI: {error}
fr_fr: Échec de la récupération des modèles OpenAI : {error}
it_it: Impossibile recuperare i modelli OpenAI: {error}
ru: Не удалось получить модели OpenAI: {error}
tr: OpenAI modelleri alınamadı: {error}

source: Failed to configure proxy for OpenAI models: {error}
ca_es: No s'ha pogut configurar el servidor intermediari per als models d'OpenAI: {error}
es_es: No se pudo configurar el proxy para los modelos de OpenAI: {error}
fr_fr: Échec de la configuration du proxy pour les modèles OpenAI : {error}
it_it: Impossibile configurare il proxy per i modelli OpenAI: {error}
ru: Не удалось настроить прокси для моделей OpenAI: {error}
tr: OpenAI modelleri için vekil sunucu yapılandırılamadı: {error}

source: Streaming rejected for {model}: {error} Retrying without streaming.
ca_es: Transmissió rebutjada per a {model}: {error}\nS'està tornant a intentar sense transmissió.
es_es: Transmisión rechazada para {model}: {error}\nReintentando sin transmisión.
fr_fr: Diffusion refusée pour {model} : {error}\nNouvel essai sans diffusion.
it_it: Streaming rifiutato per {model}: {error}\nNuovo tentativo senza streaming.
ru: Потоковая передача для {model} отклонена: {error}\nПовторная попытка без потоковой передачи.
tr: {model} için yayın reddedildi: {error}\nYayın olmadan yeniden deneniyor.

source: Streaming disabled for {model} after a previous API rejection; retrying without streaming.
ca_es: Transmissió desactivada per a {model} després d'un rebuig previ de l'API; es torna a intentar sense transmissió.
es_es: Transmisión deshabilitada para {model} tras un rechazo previo de la API; reintentando sin transmisión.
fr_fr: Diffusion désactivée pour {model} après un rejet précédent de l'API ; nouvel essai sans diffusion.
it_it: Streaming disabilitato per {model} dopo un precedente rifiuto dell'API; nuovo tentativo senza streaming.
ru: Потоковая передача для {model} отключена после предыдущего отказа API; выполняется повторная попытка без потока.
tr: Önceki bir API reddi nedeniyle {model} için yayın devre dışı bırakıldı; yayın olmadan yeniden deneniyor.

source: Streaming rejected by API; retrying without streaming.
ca_es: L'API ha rebutjat la transmissió; es torna a intentar sense transmissió.
es_es: La API rechazó la transmisión; reintentando sin transmisión.
fr_fr: La diffusion a été refusée par l'API ; nouvel essai sans diffusion.
it_it: Streaming rifiutato dall'API; nuovo tentativo senza streaming.
ru: API отклонил потоковую передачу; повторная попытка без потока.
tr: API yayını reddetti; yayın olmadan yeniden deneniyor.

source: Unfortunately, this function is too big to be analyzed with the model's current API limits.
ca_es: Desafortunadament, aquesta funció és massa gran per ser analitzada amb els límits actuals de l'API del model.
es_es: Desafortunadamente, esta función es demasiado grande para ser analizada con los límites actuales de la API del modelo.
fr_fr: Malheureusement, les limites de l'API du modèle ne permettent pas d'analyser une fonction aussi grande.
it_it: Sfortunatamente, questa funzione è troppo grande per essere analizzata con gli attuali limiti API del modello.
ru: К сожалению, данная функция слишком большая для анализа с текущими ограничениями API модели.
tr: Ne yazık ki bu fonksiyon, modelin mevcut API limitleri ile analiz edilemeyecek kadar büyüktür.

source: {model} could not complete the request: {error}
ca_es: {model} no ha pogut completar la sol·licitud: {error}
es_es: {model} no pudo completar la solicitud: {error}
fr_fr: {model} n'a pas pu satisfaire la requête : {error}
it_it: {model} non può soddisfare la richiesta: {error}
ru: {model} не смогла выполнить запрос: {error}
tr: {model} istek tamamlanamadı: {error}
